report/HerokuLogin.html/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1059.4,
    "medianResTime" : 481.0,
    "minResTime" : 303.0,
    "maxResTime" : 3597.0,
    "pct1ResTime" : 3597.0,
    "pct2ResTime" : 3597.0,
    "pct3ResTime" : 3597.0,
    "throughput" : 0.9254118082546734,
    "receivedKBytesPerSec" : 0.7858770590412735,
    "sentKBytesPerSec" : 0.2908178905237831
  },
  "upDateBooking" : {
    "transaction" : "upDateBooking",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 304.0,
    "medianResTime" : 304.0,
    "minResTime" : 304.0,
    "maxResTime" : 304.0,
    "pct1ResTime" : 304.0,
    "pct2ResTime" : 304.0,
    "pct3ResTime" : 304.0,
    "throughput" : 3.289473684210526,
    "receivedKBytesPerSec" : 2.974660773026316,
    "sentKBytesPerSec" : 1.5997635690789473
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3597.0,
    "medianResTime" : 3597.0,
    "minResTime" : 3597.0,
    "maxResTime" : 3597.0,
    "pct1ResTime" : 3597.0,
    "pct2ResTime" : 3597.0,
    "pct3ResTime" : 3597.0,
    "throughput" : 0.2780094523213789,
    "receivedKBytesPerSec" : 0.21176501251042534,
    "sentKBytesPerSec" : 0.06787340144564916
  },
  "getBooking" : {
    "transaction" : "getBooking",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 303.0,
    "medianResTime" : 303.0,
    "minResTime" : 303.0,
    "maxResTime" : 303.0,
    "pct1ResTime" : 303.0,
    "pct2ResTime" : 303.0,
    "pct3ResTime" : 303.0,
    "throughput" : 3.3003300330033003,
    "receivedKBytesPerSec" : 3.0005930280528053,
    "sentKBytesPerSec" : 0.5350144389438944
  },
  "DeleteBooking" : {
    "transaction" : "DeleteBooking",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 612.0,
    "medianResTime" : 612.0,
    "minResTime" : 612.0,
    "maxResTime" : 612.0,
    "pct1ResTime" : 612.0,
    "pct2ResTime" : 612.0,
    "pct3ResTime" : 612.0,
    "throughput" : 1.6339869281045751,
    "receivedKBytesPerSec" : 1.207937602124183,
    "sentKBytesPerSec" : 0.3590303308823529
  },
  "CreateBooking" : {
    "transaction" : "CreateBooking",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 481.0,
    "medianResTime" : 481.0,
    "minResTime" : 481.0,
    "maxResTime" : 481.0,
    "pct1ResTime" : 481.0,
    "pct2ResTime" : 481.0,
    "pct3ResTime" : 481.0,
    "throughput" : 2.079002079002079,
    "receivedKBytesPerSec" : 1.9368827962577964,
    "sentKBytesPerSec" : 0.9542294698544699
  }
}